app/Controllers/Shop/Cart.php

    public function cart_view()
    {

        $userid = $this->session->get('userid');
        $this->checkcoupon();

        // if ($userid !== '') {
        //     $data['cart_items'] = $this->db->table('cart')->select('cart.product_id,cart.id as cartid,p.id,cart.price,p.title,pi.image_name1')->join('products as p', 'p.id = cart.product_id')->join('product_images as pi', 'pi.product_id = p.id')->where('user_id', $userid)->get()->getresult();

        //     $data['cart_item_total'] = $this->db->table('cart')->select('SUM(price) as total')->where('user_id', $userid)->get()->getResult();
        // }

        $data['cart_items'] = $this->session->get('cart');
---
SELECT SUM(price) as total
FROM `cart`
WHERE `user_id` = '6'


        $data['total_cart_value'] = $total_price;

        $data['shipping'] = $this->db->table('general_settings')->where('name', 'shipping_settings')->get()->getResult();
        $data['coupons'] = $this->db->table('coupons')->where('start_date <=', date('Y-m-d'))->where('end_date >=', date('Y-m-d'))->where('status', '1')->get()->getResult();
---
SELECT *
FROM `general_settings`
WHERE `name` = 'shipping_settings'
SELECT *
FROM `coupons`
WHERE `start_date` <= '2024-07-16'
AND `end_date` >= '2024-07-16'
AND `status` = '1'