app/Controllers/Shop/Checkout.php

SELECT COUNT(*) AS `numrows`
FROM `user_address`
WHERE `user_id` = '6'
AND `is_default` = '1'
SELECT *
FROM `general_settings`
WHERE `name` = 'shipping_settings'
SELECT *
FROM `coupons`
WHERE `start_date` <= '2024-07-09'
AND `end_date` >= '2024-07-09'
AND `status` = '1'
SELECT *
FROM `user_address`
WHERE `user_id` = '6'
---
    public function checkout_view()
    {
        $userid = $this->session->get('userid');
        $this->checkcoupon();


        $data['cart_items'] = $this->session->get('cart');
        // echo'<pre>';print_r($data['cart_items']);exit;

        $total_price = 0;

        if (isset($data['cart_items']['items']) && !empty($data['cart_items']['items'])) {
            foreach ($data['cart_items']['items'] as $row) {
                $total_price = $total_price + $row['price'];
            }
        }

        $data['readytocheckoout'] = $this->db->table('user_address')->where('user_id', $userid)->where('is_default', '1')->countAllResults();

        if (isset($data['cart_items']['discount']) && !empty($data['cart_items']['discount'])) {
            $data['final_cart_value'] = $total_price - $data['cart_items']['discount'];
        } else {
            $data['final_cart_value'] = $total_price;
        }

        $data['total_cart_value'] = $total_price;

        $data['shipping'] = $this->db->table('general_settings')->where('name', 'shipping_settings')->get()->getResult();
        $data['coupons'] = $this->db->table('coupons')->where('start_date <=', date('Y-m-d'))->where('end_date >=', date('Y-m-d'))->where('status', '1')->get()->getResult();

        $data['address'] = $this->db->table('user_address')->select('*')->where('user_id', $userid)->get()->getResult();