app/Controllers/Shop/Homepage.php

SELECT `name`, `value_1`, `value_2`, `value_3`
FROM `general_settings`
WHERE `name` = 'cache'
---
    public function homepage()
    {

        $cache_row = $this->db->table('general_settings')->select('name,value_1,value_2,value_3')->where('name', 'cache')->get()->getResult();