app/Controllers/Shop/Product.php

SELECT `name`, `value_1`, `value_2`, `value_3`
FROM `general_settings`
WHERE `name` = 'productbannersection1'
SELECT `name`, `value_1`, `value_2`, `value_3`
FROM `general_settings`
WHERE `name` = 'productbannersection2'
SELECT *
FROM `general_settings`
WHERE `name` = 'productshare'
SELECT `products`.`desc`, `products`.`discount`, `products`.`id`, `products`.`title`, `pi`.`image_name1`, `pi`.`image_name2`, `products`.`stock`, `products`.`sku`, `products`.`purchasable`, `products`.`product_slug`, `pi`.`image_name3`, `pi`.`image_name4`, `products`.`price`
FROM `products`
JOIN `product_images` as `pi` ON `pi`.`product_id` = `products`.`id`
WHERE `product_slug` = 'AF45IK2Q15079230424013454'
SELECT COUNT(*) AS `numrows`
FROM `wishlist`
WHERE `product_id` = '7'
---
    public function product_page_view($category = null, $slug)
    {
        $data['productbanner1'] = $this->db->table('general_settings')->select('name,value_1,value_2,value_3')->where('name', 'productbannersection1')->get()->getResult();
        $data['productbanner2'] = $this->db->table('general_settings')->select('name,value_1,value_2,value_3')->where('name', 'productbannersection2')->get()->getResult();

        $data['productshare'] = $this->db->table('general_settings')->where('name', 'productshare')->get()->getResult();

        $limit1 = 1;
        $limit2 = 1;
        if (isset($data['productbanner1'][0]) && $data['productbanner1'][0]->value_2 != '') {
            $limit1 = $data['productbanner1'][0]->value_2;
        }
        if (isset($data['productbanner2'][0]) && $data['productbanner2'][0]->value_2 != '') {
            $limit2 = $data['productbanner2'][0]->value_2;
        }


        $data['product'] = $this->db->table('products')->select('products.desc,products.discount,products.id,products.title,pi.image_name1,pi.image_name2,products.stock,products.sku,products.purchasable,products.product_slug,,pi.image_name3,pi.image_name4,products.price')->where('product_slug', $slug)->join('product_images as pi', 'pi.product_id = products.id')->get()->getResult();

        //redirect to 404
        if (isset($data['product']) && empty($data['product'])) {
            echo view('errors/error404');
            exit;
        }

        //check wishlisted
        if (!empty($this->session->get('userid')) && $this->session->get('userid') != '') {
            $check_wishlist =  $this->db->table('wishlist')->where('product_id', $data['product'][0]->id)->countAllResults();

SELECT `categories`.`id`
FROM `products`
JOIN `product_category` ON `product_category`.`product_id` = `products`.`id`
JOIN `categories` ON `categories`.`id` = `product_category`.`category_id`
WHERE `parent_category` = ''
AND `product_slug` = 'AF45IK2Q15079230424013454'
 LIMIT 1
SELECT *
FROM `categories`
WHERE `category_slug` = 'MEN'
---
        // $data['section2'] =  $section2->get()->getResult();

        //all product categories for breadcrum
        $product_category = $this->db->table('products')->select('categories.id')->join('product_category', 'product_category.product_id = products.id')->join('categories', 'categories.id = product_category.category_id')->where('parent_category', '')->limit(1)->where('product_slug', $slug)->get()->getResult();

        $last_category_id = $this->db->table('categories')->where('category_slug', $category)->get()->getresult();

SELECT `products`.`id`, `products`.`title`, `products`.`price`, `pi`.`image_name1`, `pi`.`image_name2`, `pi`.`image_name3`, `pi`.`image_name4`, `products`.`product_slug`
FROM `products`
JOIN `product_category` ON `product_category`.`product_id` = `products`.`id`
JOIN `product_images` as `pi` ON `pi`.`product_id` = `products`.`id`
WHERE `visibility` = '1'
AND `is_deleted` = '0'
AND `product_slug` != 'AF45IK2Q86945230424012817'
AND `category_id` = '1'
AND `is_deleted` = '0'
ORDER BY `products`.`id` ASC
---
        }


        $section1 = $this->db->table('products')->select('products.discount,products.id,products.title,products.price,pi.image_name1,pi.image_name2,pi.image_name3,pi.image_name4,pi.small_image_name1,pi.small_image_name2,pi.small_image_name3,pi.small_image_name4,products.product_slug')->join('product_category', 'product_category.product_id = products.id')->where('visibility', '1')->where('is_deleted', '0')->where('product_slug !=', $slug)->where('category_id', $product_last_category_id);

SELECT `products`.`id`, `products`.`title`, `products`.`price`, `pi`.`image_name1`, `pi`.`image_name2`, `pi`.`image_name3`, `pi`.`image_name4`, `products`.`product_slug`
FROM `products`
JOIN `product_category` ON `product_category`.`product_id` = `products`.`id`
JOIN `product_images` as `pi` ON `pi`.`product_id` = `products`.`id`
WHERE `visibility` = '1'
AND `is_deleted` = '0'
AND `product_slug` != 'AF45IK2Q86945230424012817'
AND `category_id` IS NULL
AND `is_deleted` = '0'
ORDER BY `products`.`id` ASC
---

        //pair category

        $section2 = $this->db->table('products')->select('products.discount,products.id,products.title,products.price,pi.image_name1,pi.image_name2,pi.image_name3,pi.image_name4,pi.small_image_name1,pi.small_image_name2,pi.small_image_name3,pi.small_image_name4,products.product_slug')->join('product_category', 'product_category.product_id = products.id')->where('visibility', '1')->where('is_deleted', '0')->where('product_slug !=', $slug)->where('category_id', $product_pair_category);

SELECT *
FROM `reviews`
WHERE `status` = '1'
AND `product_id` = '7'
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `reviews`
WHERE `status` = '1'
AND `product_id` = '7'
---
        $data['section2'] = $section2->get()->getResult();

        //reviews
        $data['reviews'] =  $this->db->table('reviews')->where('status', '1')->where('product_id', $data['product'][0]->id)->limit(10)->get()->getResult();
        $data['reviews_total'] =  $this->db->table('reviews')->where('status', '1')->where('product_id', $data['product'][0]->id)->countAllResults();

SELECT `id`, `category_name`, `category_slug`, `pair_category`
FROM `categories`
WHERE `id` = '1'
SELECT `id`, `category_name`, `category_slug`, `pair_category`
FROM `categories`
WHERE `parent_category` = '1'
---
    public function all_product_categories($id, $last_category_id)
    {
        $category_array = array();
        $first_category = $this->db->table('categories')->select('id,category_name,category_slug,pair_category')->where('id', $id)->get()->getResult();

        $category_array[0]['id'] = $first_category[0]->id;
        $category_array[0]['name'] = $first_category[0]->category_name;
        $category_array[0]['slug'] = $first_category[0]->category_slug;
        $category_array[0]['pair_category'] = $first_category[0]->pair_category;
        $first_cat = 0;

        for ($i = 1; $i < 6; $i++) {
            $count = $this->db->table('categories')->select('id,category_name,category_slug,pair_category')->where('parent_category', $id)->get()->getResult();

INSERT INTO `wishlist` (`product_id`, `user_id`) VALUES ('2', '6')
SELECT COUNT(*) AS `numrows`
FROM `wishlist`
WHERE `user_id` = '6'
---
    public function add_to_wishlist()
    {
        $array = array(
            'product_id' => $_POST['productid'],
            'user_id' => $this->session->get('userid')

        );

        $resp['status'] = 400;

        $count = $this->db->table('wishlist')->where($array)->countAllResults();
        if ($count == 0) {
            if ($this->db->table('wishlist')->insert($array)) {
                $resp['status'] = 200;
                $resp['msg'] = 'Added to wishlist !';
            }
        } else {
            if ($this->db->table('wishlist')->delete($array)) {
                $resp['status'] = 200;
                $resp['msg'] = 'Removed to wishlist !';
            }
        }


        $wishlist_total = $this->db->table('wishlist')->where('user_id', $this->session->get('userid'))->countAllResults();

SELECT `review`, `created_at`, `stars`, `u`.`first_name`
FROM `reviews`
LEFT JOIN `users` as `u` ON `u`.`id` = `reviews`.`user_id`
WHERE `status` = '1'
AND `product_id` = '3'
ORDER BY `reviews`.`id`
 LIMIT 20
SELECT COUNT(*) AS `numrows`
FROM `reviews`
WHERE `status` = '1'
AND `product_id` = '3'
---
    public function get_product_review()
    {
        $id = $_POST['id'];
        $count = $_POST['count'];
        // print_r($_POST);
        $offset = $count;
        $data['reviews'] =  $this->db->table('reviews')->select('review,created_at,stars,u.first_name')->join('users as u','u.id = reviews.user_id','left')->limit('20')->offset($offset)->where('reviews.status', '1')->where('product_id', $id)->orderBy('reviews.id')->get()->getResult();
        $data['reviews_total'] =  $this->db->table('reviews')->where('reviews.status', '1')->where('product_id', $id)->countAllResults();