app/Controllers/Shop/Product.php

    public function search_product()
    {
        // print_r($_POST);exit;
        $data['product'] = $this->db->table('products')->select('title,product_slug,image_name1')->like('title', $_POST['search'])->limit(20)->join('product_images as pi', 'pi.product_id = products.id')->get()->getResult();
---
SELECT `title`, `product_slug`, `image_name1`
FROM `products`
JOIN `product_images` as `pi` ON `pi`.`product_id` = `products`.`id`
WHERE `title` LIKE '%over%' ESCAPE '!'
 LIMIT 20