app/Controllers/Shop/Profile.php

SELECT `full_name`, `gender`, `dob`, `email`, `mobile_no`
FROM `users`
WHERE `id` = '6'
---
    public function profile_view()
    {
        $userid = $this->session->get('userid');
        $data['user'] = $this->db->table('users')->select('full_name,gender,dob,email,mobile_no')->where('id', $userid)->get()->getResult();

SELECT *
FROM `orders`
WHERE `user_id` = '6'
---
    public function myorders()
    {
        $userid = $this->session->get('userid');
        $data['orders'] = $this->db->table('orders')->where('user_id', $userid)->get()->getResult();