app/Controllers/Shop/Profile.php

    public function delete_address()
    {
        $this->db->table('user_address')->where('id', $_POST['id'])->delete();
---
DELETE FROM `user_address`
WHERE `id` = '6'