app/Controllers/Shop/Wishlist.php

SELECT `products`.`discount`, `products`.`id`, `products`.`title`, `products`.`price`, `product_images`.`image_name1`, `product_images`.`image_name2`, `product_images`.`image_name3`, `product_images`.`image_name4`, `product_images`.`small_image_name1`, `product_images`.`small_image_name2`, `product_images`.`small_image_name3`, `product_images`.`small_image_name4`, `products`.`product_slug`, `wishlist`.`user_id` as `wishlist`
FROM `products`
JOIN `wishlist` ON `wishlist`.`product_id` = `products`.`id`
JOIN `product_images` ON `product_images`.`product_id` = `products`.`id`
WHERE `wishlist`.`user_id` = '6'
AND `is_deleted` = '0'
AND `visibility` = '1'
 LIMIT 25
SELECT COUNT(*) AS `numrows`
FROM `products`
JOIN `wishlist` ON `wishlist`.`product_id` = `products`.`id`
JOIN `product_images` ON `product_images`.`product_id` = `products`.`id`
WHERE `wishlist`.`user_id` = '6'
AND `is_deleted` = '0'
AND `visibility` = '1'
---
    public function view()
    {
        $pager = service('pager');

        $perPage = '25';
        $userid = $this->session->get('userid');
        $data['products'] = '';
        $page = (@$_GET['page']) ? $_GET['page'] : 1;
        $offset = ($page-1) * $perPage;


        if ($userid !== '') {
            $data['products'] = $this->db->table('products')->select('products.id,products.title,products.price,product_images.image_name1,product_images.image_name2,product_images.image_name3,product_images.image_name4,products.product_slug,wishlist.user_id as wishlist')->join('wishlist','wishlist.product_id = products.id')->where('wishlist.user_id',$this->session->get('userid'))->join('product_images','product_images.product_id = products.id')->where('is_deleted','0')->where('visibility','1')->get($perPage,$offset)->getResult();
        }

        $total = $this->db->table('products')->select('products.id,products.title,products.price,product_images.image_name1,product_images.image_name2,product_images.image_name3,product_images.image_name4,products.product_slug,wishlist.user_id as wishlist')->join('wishlist','wishlist.product_id = products.id')->where('wishlist.user_id',$this->session->get('userid'))->join('product_images','product_images.product_id = products.id')->where('is_deleted','0')->where('visibility','1')->countAllResults();