app/Controllers/Admin/Category.php

SELECT `category_banner`.`image`, `category_banner`.`order`, `category_banner`.`id`, `c`.`category_name`
FROM `category_banner`
JOIN `categories` as `c` ON `c`.`id` = `category_banner`.`category_id`
SELECT *
FROM `categories`
---
    public function category_banner_view()
    {
        $data['category'] = $this->db->table('category_banner')->select('mobile_image,category_banner.image,category_banner.order,category_banner.id,c.category_name')->join('categories as c', 'c.id = category_banner.category_id')->get()->getResult();
        $data['all_categories'] = $this->db->table('categories')->get()->getResult();

SELECT *
FROM `category_banner`
WHERE `id` = '4'
---
                $data['status'] = 400;
            }
        } else {
            $category_info = $this->db->table('category_banner')->where('id', $_POST['id'])->get()->getResult();