app/Controllers/Admin/Orders.php

SELECT *
FROM `orders`
WHERE `id` = '8'
---
    public function ajax_order_info()
    {
        $data['order'] = $this->db->table('orders')->where('id', $_POST['id'])->get()->getResult();