app/Controllers/Admin/Products.php

SELECT *
FROM `product_category`
WHERE `product_id` = '2'
SELECT *
FROM `products`
JOIN `product_category` as `pc` ON `pc`.`product_id` = `products`.`id`
JOIN `product_images` as `pi` ON `pi`.`product_id` = `products`.`id`
LEFT JOIN `product_badge` as `pb` ON `pb`.`product_id` = `products`.`id`
WHERE `products`.`id` = '2'
---
    public function add_products($id = '')
    {
        $data = array();

        if ($id != '') {
            $data['product'] =  $this->db->table('products')->join('product_category as pc', 'pc.product_id = products.id')->join('product_images as pi', 'pi.product_id = products.id')->where('products.id', $id)->get()->getresult();
        }

        $data['categories'] = $this->db->table('categories')->get()->getresult();

UPDATE `products` SET `title` = 'SAME SH*T DIFFERENT DAY - COURAGE THE COWARDLY DOG OFFICIAL T-SHIRT', `desc` = 'The artwork will be screen printed to perfection on our premium, regular fit 100% Cotton Redwolf branded tees that you know and love.', `price` = '549', `stock` = '12', `sku` = 'AF45IK2Q', `promote` = 'section1', `purchasable` = '1', `product_slug` = 'SAME-SH*T-DIFFERENT-DAY---COURAGE-THE-COWARDLY-DOG-OFFICIAL-T-SHIRT'
WHERE `id` = '2'
---
                $productid = $_POST['productid'];

                $category_array['product_id'] = $productid;
                $this->db->table('product_category')->where('product_id', $productid)->update($category_array);

SELECT *
FROM `product_images`
WHERE `product_id` = '2'
---
                    'storage' => 'local'
                );

                $productinfo = $this->db->table('product_images')->where('product_id', $_POST['productid'])->get()->getResult();

UPDATE `product_images` SET `product_id` = '2', `storage` = 'local'
WHERE `product_id` = '2'
---
                } else {
                }

                $this->db->table('product_images')->where('product_id', $productid)->update($image_array);