app/Controllers/Admin/Reviews.php

SELECT *
FROM `reviews`
WHERE `soft_delete` = '1'
---
    public function deleted_list()
    {
        $data['reviews'] = $this->db->table('reviews')->select('*')->where('soft_delete', '1')->get()->getResult();