app/Controllers/Admin/Website_settings.php

    public function view()
    {
        $data['banner1'] = $this->db->table('general_settings')->where('name', 'bannersection1')->get()->getResult();
        $data['banner2'] = $this->db->table('general_settings')->where('name', 'bannersection2')->get()->getResult();


        $data['productbanner1'] = $this->db->table('general_settings')->where('name', 'productbannersection1')->get()->getResult();
        $data['productbanner2'] = $this->db->table('general_settings')->where('name', 'productbannersection2')->get()->getResult();

        $data['banner_section1name'] = $this->db->table('general_settings')->where('name', 'banner_section1name')->get()->getResult();
        $data['banner_section2name'] = $this->db->table('general_settings')->where('name', 'banner_section2name')->get()->getResult();
        $data['banner_section3name'] = $this->db->table('general_settings')->where('name', 'banner_section3name')->get()->getResult();
        $data['banner_section4name'] = $this->db->table('general_settings')->where('name', 'banner_section4name')->get()->getResult();


        $data['productshare'] = $this->db->table('general_settings')->where('name', 'productshare')->get()->getResult();
---
SELECT *
FROM `general_settings`
WHERE `name` = 'bannersection1'
SELECT *
FROM `general_settings`
WHERE `name` = 'bannersection2'
SELECT *
FROM `general_settings`
WHERE `name` = 'productbannersection1'
SELECT *
FROM `general_settings`
WHERE `name` = 'productbannersection2'
SELECT *
FROM `general_settings`
WHERE `name` = 'banner_section1name'
SELECT *
FROM `general_settings`
WHERE `name` = 'banner_section2name'
SELECT *
FROM `general_settings`
WHERE `name` = 'banner_section3name'
SELECT *
FROM `general_settings`
WHERE `name` = 'banner_section4name'
SELECT *
FROM `general_settings`
WHERE `name` = 'productshare'

    public function add_website_settings()
    {
        $array = array(
            'name' => 'bannersection1',
            'value_1' => $_POST['banner1name'],
            'value_2' => $_POST['banner1link'],
            'value_3' => $_POST['banner1slider'],
        );


        $this->db->table('general_settings')->where('name', 'bannersection1')->delete();

        if ($this->db->table('general_settings')->insert($array)) {
            $data['status'] = 200;
        } else {
            $data['status'] = 400;
        }

        $array2 = array(
            'name' => 'bannersection2',
            'value_1' => $_POST['banner2name'],
            'value_2' => $_POST['banner2link'],
            'value_3' => $_POST['banner2slider'],
        );


        $this->db->table('general_settings')->where('name', 'bannersection2')->delete();

        if ($this->db->table('general_settings')->insert($array2)) {
---
DELETE FROM `general_settings`
WHERE `name` = 'bannersection1'
INSERT INTO `general_settings` (`name`, `value_1`, `value_2`, `value_3`) VALUES ('bannersection1', 'BE A SUPER HERO', 'bannerlink1', 'NO')
DELETE FROM `general_settings`
WHERE `name` = 'bannersection2'
INSERT INTO `general_settings` (`name`, `value_1`, `value_2`, `value_3`) VALUES ('bannersection2', 'TSHIRTS', 'TSHIRTS', 'YES')