app/Helpers/custom_helper.php

function get_categories($id)
{
    // $CI =& get_instance();
    $db = \Config\Database::connect();

    $data = $db->table('categories')->where('parent_category', $id)->get()->getResult();
---
SELECT *
FROM `categories`
WHERE `parent_category` = '1'

function website_settings()
{
    $db = \Config\Database::connect();
    $data =  $db->table('general_settings')->where('name', 'website_settings')->get()->getResult();
---
SELECT *
FROM `general_settings`
WHERE `name` = 'website_settings'

function get_product_badge($id)
{
    // $CI =& get_instance();
    $db = \Config\Database::connect();

    $data = $db->table('product_badge')->where('product_id', $id)->get()->getResult();
---
SELECT *
FROM `product_badge`
WHERE `product_id` = '1'

function get_categories_header()
{
    // $CI =& get_instance();
    $db = \Config\Database::connect();

    $data = $db->table('categories')->orderBy('category_order', 'ASC')->where('show_on_homepage', '1')->get()->getResult();
---
SELECT *
FROM `categories`
WHERE `show_on_homepage` = '1'
ORDER BY `category_order` ASC

function get_category_by_productid($id)
{
    // $CI =& get_instance();
    $db = \Config\Database::connect();

    $data = $db->table('product_category')->select('category_slug')->join('categories', 'categories.id = product_category.category_id')->orderBy('product_category.id', 'DESC')->limit(1)->where('product_id', $id)->get()->getResult();
---
SELECT `category_slug`
FROM `product_category`
JOIN `categories` ON `categories`.`id` = `product_category`.`category_id`
WHERE `product_id` = '1'
ORDER BY `product_category`.`id` DESC
 LIMIT 1

function get_sizechart_by_productid($id)
{
    // $CI =& get_instance();
    $db = \Config\Database::connect();

    $sizechart = $db->table('sizechart')->select('sizechart')->where('category_id', $id)->get()->getresult();
---
SELECT `sizechart`
FROM `sizechart`
WHERE `category_id` = '1'

function sidebar_image()
{
    // $CI =& get_instance();
    $db = \Config\Database::connect();

    $sidebar_image = $db->table('general_settings')->select('*')->where('name', 'website_settings2')->get()->getresult();
---
SELECT *
FROM `general_settings`
WHERE `name` = 'website_settings2'

function set_cache($name, $key)
{
    // $CI =& get_instance();
    $db = \Config\Database::connect();

    $array = array(
        $key => strtotime(date('Y-m-d H:i:s')),
        'name' => $name
    );

    $count = $db->table('general_settings')->select('id')->where('name', $name)->countAllResults();;
    if ($count > 0) {
        $db->table('general_settings')->set($array)->where('name', $name)->update();
---
SELECT COUNT(*) AS `numrows`
FROM `general_settings`
WHERE `name` = 'cache'
UPDATE `general_settings` SET `value_3` = 1719136337, `name` = 'cache'
WHERE `name` = 'cache'

function footer_settings()
{
    $db = \Config\Database::connect();

    $footer['footer'] = $db->table('footer')->select('*')->where('id', '1')->get()->getresult();
    if (empty($footer['footer'])) {
        $category_limit = '5';
    } else {
        $category_limit = $footer['footer'][0]->category_limit;
    }
    $footer['categories'] = $db->table('categories')->select('category_name,category_slug')->limit($category_limit)->where('parent_category', '')->where('show_on_homepage', '1')->orderBy('category_order', 'asc')->get()->getresult();
---
SELECT *
FROM `footer`
WHERE `id` = '1'
SELECT `category_name`, `category_slug`
FROM `categories`
WHERE `parent_category` = ''
AND `show_on_homepage` = '1'
ORDER BY `category_order` ASC
 LIMIT 5

function is_wishlist($userid, $productid)
{
    $db = \Config\Database::connect();

    $count = $db->table('wishlist')->where('user_id', $userid)->where('product_id', $productid)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `wishlist`
WHERE `user_id` = '6'
AND `product_id` = '1'

function cartdetails($productid)
{
    $db = \Config\Database::connect();

    $data = $db->table('products')->select('category_slug,products.product_slug,products.title,pi.image_name1')->join('product_images as pi', 'pi.product_id = products.id')->join('product_category as pc', 'pc.product_id = products.id')->join('categories as c', 'c.id = pc.category_id')->where('pi.product_id', $productid)->groupBy('products.id')->get()->getresult();
---
SELECT `category_slug`, `products`.`product_slug`, `products`.`title`, `pi`.`image_name1`
FROM `products`
JOIN `product_images` as `pi` ON `pi`.`product_id` = `products`.`id`
JOIN `product_category` as `pc` ON `pc`.`product_id` = `products`.`id`
JOIN `categories` as `c` ON `c`.`id` = `pc`.`category_id`
WHERE `pi`.`product_id` = '1'
GROUP BY `products`.`id`

function get_wishlist_count($userid)
{
    $db = \Config\Database::connect();

    $data = $db->table('wishlist')->where('user_id', $userid)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `wishlist`
WHERE `user_id` = '6'

function get_product_image($product_id)
{
    $db = \Config\Database::connect();

    $data = $db->table('product_images')->where('product_id', $product_id)->get()->getresult();
---
SELECT *
FROM `product_images`
WHERE `product_id` = '1'

function get_order_products($orderid){
    $db = \Config\Database::connect();

    $data = $db->table('order_products')->where('order_id', $orderid)->get()->getresult();
---
SELECT *
FROM `order_products`
WHERE `order_id` = '7'