app/Controllers/BaseController.php

    public function checkcoupon()
    {
        $this->db = \Config\Database::connect();
        $this->session = \Config\Services::session();

        $data['cart_items'] = $this->session->get('cart');

        //validate existing coupon
        if (isset($data['cart_items']['couponcode']) && !empty($data['cart_items']['couponcode'] && $data['cart_items']['couponcode'] != '')) {
            $couponcode = $data['cart_items']['couponcode'];
            $coupondata = $this->db->table('coupons')->where('code', $couponcode)->get()->getResult();
---
SELECT *
FROM `coupons`
WHERE `code` = '50Percent'